adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessBridgeChild.cpp
//
// Automatically generated by ipdlc.
// Edit at your own risk
//


#include "mozilla/net/PSocketProcessBridgeChild.h"
#include "mozilla/ProfilerLabels.h"
#include "mozilla/net/SocketProcessBridgeChild.h"

#include "mozilla/ipc/PBackgroundChild.h"

#include "ipc/IPCMessageUtils.h"
#include "nsIFile.h"
#include "mozilla/ipc/Endpoint.h"
#include "mozilla/ipc/ProtocolMessageUtils.h"
#include "mozilla/ipc/ProtocolUtils.h"
#include "mozilla/ipc/ShmemMessageUtils.h"
#include "mozilla/ipc/TaintingIPCUtils.h"

namespace mozilla {
namespace net {


auto PSocketProcessBridgeChild::ProcessingError(
        Result aCode,
        const char* aReason) -> void
{
}

auto PSocketProcessBridgeChild::ShouldContinueFromReplyTimeout() -> bool
{
    return true;
}

auto PSocketProcessBridgeChild::EnteredCxxStack() -> void
{
}

auto PSocketProcessBridgeChild::ExitedCxxStack() -> void
{
}

auto PSocketProcessBridgeChild::EnteredCall() -> void
{
}

auto PSocketProcessBridgeChild::ExitedCall() -> void
{
}

MOZ_IMPLICIT PSocketProcessBridgeChild::PSocketProcessBridgeChild() :
    mozilla::ipc::IToplevelProtocol("PSocketProcessBridgeChild", PSocketProcessBridgeMsgStart, mozilla::ipc::ChildSide)
{
    MOZ_COUNT_CTOR(PSocketProcessBridgeChild);
}

PSocketProcessBridgeChild::~PSocketProcessBridgeChild()
{
    MOZ_COUNT_DTOR(PSocketProcessBridgeChild);
}

auto PSocketProcessBridgeChild::AllManagedActors(nsTArray<RefPtr<mozilla::ipc::ActorLifecycleProxy>>& arr__) const -> void
{
    uint32_t total = 0;
    arr__.SetCapacity(total);

}

auto PSocketProcessBridgeChild::SendInitBackground(Endpoint<mozilla::ipc::PBackgroundParent>&& aEndpoint) -> bool
{
    IPC::Message* msg__ = PSocketProcessBridge::Msg_InitBackground(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, std::move(aEndpoint));
    // Sentinel = 'aEndpoint'
    (msg__)->WriteSentinel(292225955);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessBridgeChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessBridgeChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcessBridge::Msg_InitBackground", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessBridgeChild::SendTest() -> bool
{
    IPC::Message* msg__ = PSocketProcessBridge::Msg_Test(MSG_ROUTING_CONTROL);





    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessBridgeChild")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessBridgeChild",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcessBridge::Msg_Test", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessBridgeChild::RemoveManagee(
        int32_t aProtocolId,
        IProtocol* aListener) -> void
{
    FatalError("unreached");
    return;
}

auto PSocketProcessBridgeChild::DeallocManagee(
        int32_t aProtocolId,
        IProtocol* aListener) -> void
{
    FatalError("unreached");
    return;
}

auto PSocketProcessBridgeChild::OnMessageReceived(const Message& msg__) -> PSocketProcessBridgeChild::Result
{
    switch (msg__.type()) {
    case PSocketProcessBridge::Msg_Test__ID:
        {
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessBridgeChild")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessBridgeChild",
                    OtherPid(),
                    "Received ",
                    (&(msg__))->type(),
                    mozilla::ipc::MessageDirection::eReceiving);
            }
            AUTO_PROFILER_LABEL("PSocketProcessBridge::Msg_Test", OTHER);

            if ((!((static_cast<SocketProcessBridgeChild*>(this))->RecvTest()))) {
                mozilla::ipc::ProtocolErrorBreakpoint("Handler returned error code!");
                // Error handled in mozilla::ipc::IPCResult
                return MsgProcessingError;
            }

            return MsgProcessed;
        }
    default:
        return MsgNotKnown;
    case SHMEM_CREATED_MESSAGE_TYPE:
        {
            FatalError("this protocol tree does not use shmem");
            return MsgNotKnown;
        }
    case SHMEM_DESTROYED_MESSAGE_TYPE:
        {
            FatalError("this protocol tree does not use shmem");
            return MsgNotKnown;
        }
    }
}

auto PSocketProcessBridgeChild::OnMessageReceived(
        const Message& msg__,
        Message*& reply__) -> PSocketProcessBridgeChild::Result
{
    return MsgNotKnown;
}

auto PSocketProcessBridgeChild::OnCallReceived(
        const Message& msg__,
        Message*& reply__) -> PSocketProcessBridgeChild::Result
{
    MOZ_ASSERT_UNREACHABLE("message protocol not supported");
    return MsgNotKnown;
}

auto PSocketProcessBridgeChild::OnChannelClose() -> void
{
    DestroySubtree(NormalShutdown);
    ClearSubtree();
    DeallocShmems();
    if (GetLifecycleProxy()) {
        GetLifecycleProxy()->Release();
    }
}

auto PSocketProcessBridgeChild::OnChannelError() -> void
{
    DestroySubtree(AbnormalShutdown);
    ClearSubtree();
    DeallocShmems();
    if (GetLifecycleProxy()) {
        GetLifecycleProxy()->Release();
    }
}

auto PSocketProcessBridgeChild::ClearSubtree() -> void
{
}



} // namespace net
} // namespace mozilla
namespace mozilla {
namespace ipc {
auto IPDLParamTraits<mozilla::net::PSocketProcessBridgeChild*>::Write(
        IPC::Message* aMsg,
        mozilla::ipc::IProtocol* aActor,
        const paramType& aVar) -> void
{
    int32_t id;
    if (!aVar) {
        id = 0;  // kNullActorId
    } else {
        id = aVar->Id();
        if (id == 1) {  // kFreedActorId
            aVar->FatalError("Actor has been |delete|d");
        }
        MOZ_RELEASE_ASSERT(
            aActor->GetIPCChannel() == aVar->GetIPCChannel(),
            "Actor must be from the same channel as the"
            " actor it's being sent over");
        MOZ_RELEASE_ASSERT(
            aVar->CanSend(),
            "Actor must still be open when sending");
    }

    WriteIPDLParam(aMsg, aActor, id);
}

auto IPDLParamTraits<mozilla::net::PSocketProcessBridgeChild*>::Read(
        const IPC::Message* aMsg,
        PickleIterator* aIter,
        mozilla::ipc::IProtocol* aActor,
        paramType* aVar) -> bool
{
    mozilla::Maybe<mozilla::ipc::IProtocol*> actor =
        aActor->ReadActor(aMsg, aIter, true, "PSocketProcessBridge", PSocketProcessBridgeMsgStart);
    if (actor.isNothing()) {
        return false;
    }

    *aVar = static_cast<mozilla::net::PSocketProcessBridgeChild*>(actor.value());
    return true;
}

} // namespace ipc
} // namespace mozilla
